app/views/movies/index.html.erb

SELECT "movies".* FROM "movies" WHERE "movies"."rating" IN ('G', 'PG', 'PG-13', 'R') AND "movies"."rating" IN ('G', 'PG', 'PG-13', 'R')  ORDER BY title
---
    <tr>
      <th><%=link_to("Movie Title", movies_path(:sort => 'title', :ratings => Hash[@ratings_to_show.map {|k| [k, 1]}]), :id => 'title_header', :class => @title_bg )%></th>