app/controllers/movies_controller.rb

    def index
      #@movies = Movie.all
      @all_ratings = Movie.all_ratings
      @ratings_to_show = []
      if params[:ratings].nil? == false
        @ratings_to_show = params[:ratings].keys()
        @ratings_to_show_hash = Hash[@ratings_to_show.map {|k| [k, '1']}]
      end
      @movies = Movie.with_ratings(@ratings_to_show)

      @title_header = ''
      @release_date_header = ''

      if params.has_key?(:sort)
        @movies = @movies.order(params[:sort])
---
SELECT "movies".* FROM "movies" WHERE "movies"."rating" IN ('G', 'PG', 'PG-13', 'R') AND "movies"."rating" IN ('G', 'PG', 'PG-13', 'R')  ORDER BY title